
Задача 1. Да се напише if-конструкция, която проверява стойността на две целочислени
променливи и разменя техните стойности, ако стойността на първата променлива е по-голяма
от втората. 





a = 10
b = 6
if b > a:
  print("b is greater than a")
elif a == b:
  print("a and b are equal")

else:
    print("a is greater than b")
    

a= 10
b = 6
a = a + b # a = 16, b = 6
b = a - b # a = 16, b = 10
a = a - b # a = 6,  b = 10

print(a) # 6
print(b) # 10



    




